# Функции
# Отложить подушку
# Сложить одеяло
# Положить подушку на одеяло
# Накрыть покрывалом

# Заправь кровать -
# Отложить подушку
# Сложить одеяло
# Положить подушку на одеяло
# Накрыть покрывалом


# def print_numbers():
#     for i in range(1, 11):
#         print(i)
#
# print_numbers()


# def print_card(name):
#     print(f'{name}, поздравляю с днем рождения!')
#
# print_card('Настя')
# print_card('Антон')
# print_card('Марат')



# Реализовать функцию, которая печатает строку в формате:
# Стоимость: <price>

# Реализовать функцию, которая печатает "Hello"






