# Сокращенные арифметические операторы
# a = 10 # копилка
# a = a + 5
# a += 3
# a -= 3
# a *= 2
# a //= 4
# a /= 4
# a %= 4
# print(a)

# Пользователь вводит число, необходимо уменьшить его в 3 раза
# n = int(input())
# n //= 4
# print(n)

# bool

# n = 10 + 6
# Логическое выражения
# True - истина
# False - ложь
# r = n < 10
# print(r)
# 5 >= 5
# Логические операторы
# >
# <
# >=
# <=
# =
# !=
# n = 1
# while n != 100:
#     print(n)
#     n += 1

# print(4 == 4)
# n = 6


# x = int(input('Введите число: '))
# print(x >= 7)


# n = int(input("Введите число: "))
# # print(n <= 13)

# and - И
# n = int(input("Введите число: "))
# print(n > 5 and n < 8)


# n = int(input("Введите число: "))
# print(n >=50 and n <=86)


# n = int(input("Введите число: "))
# print(n <=10 or n >=20)

# n = int(input("Введите число: "))
# print(n != 10)
#
# print(not (n == 10))


# Пользователь вводит число - кол-во рублей в кармане
# Распечатать "Можешь купить пирожок", если рублей  > 50

n = int(input("Введите кол-во рублей в кармане: "))
if n < 50:
    print("Ты не можешь купить пирожок")
else:
    print("Ты можешь купить пирожок")

# if
# elif
# elif
# elif
# elif
# elif
# else